//## Консольная игра угадай число


//ПК загадал в некотором диапазоне число, например от 1 до 100
/* Далее он предлагает игроку угадать это число
Игрок вводит некоторое число
1. правильное это ли число
2. загаданное число больше чем введенное 
3. загаданное число меньше чем введенное 
После этого у игрок делает следующую догадку
У игрока есть некоторое количесвто попыток

Если игрок потратил все свои попытки игра заканчивается.
Если игрок угадал число но попытки еще остались игра также заканчивается */


